app/controllers/articles_controller.rb

  def index
    # grab all the articles for the index page
    @articles = Article.all
---
SELECT "articles".* FROM "articles"